tap "d12frosted/emacs-plus"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "mopidy/mopidy"
tap "sachaos/todoist"
brew "antigen"
brew "python@3.8"
brew "azure-cli"
brew "cairo"
brew "cloc"
brew "csvkit"
brew "fdk-aac-encoder"
brew "gobject-introspection"
brew "harfbuzz"
brew "lame"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-extras"
brew "hugo"
brew "imagemagick"
brew "imagemagick@6"
brew "inetutils"
brew "jq"
brew "libav"
brew "pango"
brew "librsvg"
brew "libxml2"
brew "luajit", args: ["HEAD"]
brew "ruby"
brew "macvim"
brew "mono-libgdiplus"
brew "node"
brew "nativefier"
brew "tree-sitter"
brew "neovim", args: ["HEAD"]
brew "osx-cpu-temp"
brew "pyenv"
brew "r"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "switchaudio-osx"
brew "tldr"
brew "tmux"
brew "tree"
brew "wget"
brew "wtfutil"
brew "youtube-dl"
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-elrumo2-icon", "with-no-titlebar"]
cask "1password"
cask "alacritty"
cask "alfred"
cask "amethyst"
cask "anki"
cask "blackhole-2ch"
cask "contexts"
cask "discord"
cask "dotnet-sdk"
cask "dropbox"
cask "dupeguru"
cask "eloston-chromium"
cask "firefox"
cask "hammerspoon"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "monitorcontrol"
cask "obs"
cask "onedrive"
cask "powershell"
cask "qutebrowser"
cask "rider"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "tableplus"
cask "whichspace"
