tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "azure-cli"
brew "bat"
brew "cloc"
brew "coreutils"
brew "csvkit"
brew "datasette"
brew "deno"
brew "fdk-aac-encoder"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "go"
brew "imagemagick"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-elrumo2-icon"]
brew "inetutils"
brew "jd"
brew "jnv"
brew "jq"
brew "macvim"
brew "neovim"
brew "pandoc"
brew "pyenv"
brew "python@3.12"
brew "r"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rust"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "wget"
brew "wtfutil"
brew "yt-dlp"
brew "zlib"
brew "zsh"
cask "1password"
cask "1password-cli"
cask "ableton-live-suite@11"
cask "alacritty"
cask "alfred"
cask "amethyst"
cask "anki"
cask "blackhole-2ch"
cask "contexts"
cask "cursor"
cask "discord"
cask "dotnet-sdk"
cask "drawio"
cask "dupeguru"
cask "element"
cask "eloston-chromium"
cask "firefox"
cask "font-iosevka"
cask "google-chrome"
cask "hammerspoon"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "linear-linear"
cask "linearmouse"
cask "mactex"
cask "microsoft-office"
cask "minecraft"
cask "notion"
cask "obs"
cask "obsidian"
cask "powershell"
cask "raycast"
cask "recut"
cask "rekordbox"
cask "rider"
cask "signal"
cask "slack"
cask "soulseek"
cask "spotify"
cask "steam"
cask "sublime-merge"
cask "sublime-text"
cask "tableplus"
cask "visual-studio-code"
cask "webstorm"
cask "whichspace"
cask "wkhtmltopdf"
cask "zed"
vscode "asvetliakov.vscode-neovim"
vscode "bierner.markdown-mermaid"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "jdinhlife.gruvbox"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "yoavbls.pretty-ts-errors"
