tap "caskroom/cask"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "mopidy/mopidy"

brew "antigen"
brew "cloc"
brew "fdk-aac-encoder"
brew "fzf"
brew "git"
brew "git-extras"
brew "lame"
brew "libxml2"
brew "macvim"
brew "mono-libgdiplus"
brew "node"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "thefuck"
brew "tmux"
brew "tree"
brew "wget"
brew "youtube-dl"
brew "z"
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus", args: ["HEAD", 'with-natural-title-bars']

cask "1password"
cask "alacritty"
cask "alfred"
cask "anki"
cask "contexts"
cask "dropbox"
cask "dupeguru"
cask "firefox"
cask "google-chrome"
cask "handbrake"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "mono-mdk"
cask "onedrive"
cask "postman"
cask "rider"
cask "rstudio"
cask "slack"
cask "sloth"
cask "spectacle"
cask "sublime-merge"
cask "sublime-text"
cask "tableplus"
cask "visual-studio-code"
# Set up taps
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'd12frosted/emacs-plus'

# General purpose binaries

cask 'alfred'
cask 'anki'
cask '1password'
cask 'dropbox'
cask 'contexts'
cask 'spotify'
cask 'spectacle'
cask 'karabiner-elements'
cask 'iterm2'
cask 'slack'
cask 'firefox'
cask 'google-chrome'
cask 'vlc'
cask 'onedrive'
cask 'dupeguru'

# Development
cask 'postman'
cask 'visual-studio-code'
cask 'sublime-text'
cask 'sublime-merge'
cask 'tableplus'
brew 'emacs-plus', args: ['HEAD', 'with-natural-title-bars']
brew 'macvim'

## R
cask 'rstudio'
brew 'r'

## C#
cask 'rider'
brew 'mono-libgdiplus'

# Terminal 
brew 'antigen'
brew 'thefuck'
brew 'z'
brew 'git'
brew 'zsh'
brew 'tree'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'ag'
brew 'cloc'

# Other
brew 'youtube-dl'
